test_text="Aa Bb Cc Dd Ee Ff Gg Hh Ii Jj Kk Ll Mm Nn Oo Pp Qq Rr Ss Tt Uu Vv Ww Xx Yy Zz Zhzh Chch Shsh Yoyo Yaya "
replace_table=[
    ["by","бай"],
    ["By","Бай"],
    ["The","Дзе"],
    ["the","дзе"],
    ["t'h","дз"],
    ["T'h","Дз"],
    ["too","ту"],
    ["Too","Ту"],
    ["to","ту"],
    ["To","Ту"],
    ["ss","с"],
    ["cc","кс"],
    ["Wh","У"],
    ["pp","п"],
    ["tt","т"],
    ["tion","шен"],
    ["ph","ф"],
    ["Ph","Ф"],
    ["q","ку"],
    ["Q","Ку"],
    ["zh","ж"],
    ["Zh","Ж"],
    ["sh","ш"],
    ["Sh","Ш"],
    ["ch","ч"],
    ["Ch","Ч"],
    ["you","ю"],
    ["You","Ю"],
    ["yo","ю"],
    ["Yo","Ю"],
    ["iu","ю"],
    ["iu","Ю"],
    ["I ","Я "],
    ["I'm","Я'м"],
    ["ya","я"],
    ["Ya","Я"],
    ["a","а"],["b","б"],["c","с"],["d","д"],["e","е"],["f","ф"],["g","г"],["h","х"],["i","и"],["j","ж"],["k","к"],["l","л"],["m","м"],["n","н"],["o","о"],["p","п"],["r","р"],["s","с"],["t","т"],["u","у"],["v","в"],["w","у"],["x","с"],["y","й"],["z","з"],["A","А"],["B","Б"],["C","С"],["D","Д"],["E","Е"],["F","Ф"],["G","Г"],["H","Х"],["I","И"],["J","Ж"],["K","К"],["L","Л"],["M","М"],["N","Н"],["O","О"],["P","П"],["R","Р"],["S","С"],["T","Т"],["U","У"],["V","В"],["W","У"],["X","С"],["Y","Й"],["Z","З"],
    ["''",""],
    ['"',""],
    ["  ",""]
]


def main():
    cyrillic=input()

    for group in replace_table:
        cyrillic=cyrillic.replace(group[0],group[1])

    print(cyrillic)

if __name__=="__main__":
    while True:
        main()